TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l211x.h
typedef struct {
    UNICOMM_Regs         * const inst;
    UNICOMMUART_Regs     * const uart;
    UNICOMMI2CC_Regs     * const i2cc;
    UNICOMMI2CT_Regs     * const i2ct;
    UNICOMMSPI_Regs      * const spi;
    bool                   const fixedMode;
} UNICOMM_Inst_Regs;

static const UNICOMM_Inst_Regs UC4_Inst = {
    .inst      = (UNICOMM_Regs *) UC4_BASE,
    .uart      = (UNICOMMUART_Regs *) UC4_UART_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC4_SPI_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC6_Inst = {
    .inst      = (UNICOMM_Regs *) UC6_BASE,
    .i2cc      = (UNICOMMI2CC_Regs *) UC6_I2CC_BASE,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC7_Inst = {
    .inst      = (UNICOMM_Regs *) UC7_BASE,
    .i2ct      = (UNICOMMI2CT_Regs *) UC7_I2CT_BASE,
    .fixedMode = true
};
static const UNICOMM_Inst_Regs UC8_Inst = {
    .inst      = (UNICOMM_Regs *) UC8_BASE,
    .uart      = (UNICOMMUART_Regs *) UC8_UART_BASE,
    .spi       = (UNICOMMSPI_Regs *) UC8_SPI_BASE,
    .fixedMode = false
};
static const UNICOMM_Inst_Regs UC11_Inst = {
    .inst      = (UNICOMM_Regs *) UC11_BASE,
    .uart      = (UNICOMMUART_Regs *) UC11_UART_BASE,
    .fixedMode = true
};


/*@}*/ /* end of group MSPM0L211X_MemoryMap */

/******************************************************************************
* Peripheral declarations                                                     *
******************************************************************************/
/** @addtogroup MSPM0L211X_PeripheralDecl MSPM0L211X Peripheral Declaration
  @{
*/

static ADC12_Regs                               * const ADC0                           = ((ADC12_Regs *) ADC0_BASE);
static COMP_Regs                                * const COMP0                          = ((COMP_Regs *) COMP0_BASE);
static VREF_Regs                                * const VREF                           = ((VREF_Regs *) VREF_BASE);
static LCD_Regs                                 * const LCD                            = ((LCD_Regs *) LCD_BASE);
static WWDT_Regs                                * const WWDT0                          = ((WWDT_Regs *) WWDT0_BASE);
static GPTIMER_Regs                             * const TIMG14                         = ((GPTIMER_Regs *) TIMG14_BASE);
static GPTIMER_Regs                             * const TIMG1                          = ((GPTIMER_Regs *) TIMG1_BASE);
static GPTIMER_Regs                             * const TIMG2                          = ((GPTIMER_Regs *) TIMG2_BASE);
static LFSS_Regs                                * const LFSS                           = ((LFSS_Regs *) LFSS_BASE);
static RTC_Regs                                 * const RTC_B                          = ((RTC_Regs *) RTC_B_BASE);
static GPIO_Regs                                * const GPIOA                          = ((GPIO_Regs *) GPIOA_BASE);
static GPIO_Regs                                * const GPIOB                          = ((GPIO_Regs *) GPIOB_BASE);
static KEYSTORECTL_Regs                         * const KEYSTORECTL                    = ((KEYSTORECTL_Regs *) KEYSTORECTL_BASE);
static SYSCTL_Regs                              * const SYSCTL                         = ((SYSCTL_Regs *) SYSCTL_BASE);
static BTIMER_Regs                              * const TIMB0                          = ((BTIMER_Regs *) TIMB0_BASE);
static BTIMER_Regs                              * const TIMB1                          = ((BTIMER_Regs *) TIMB1_BASE);
static BTIMER_Regs                              * const TIMB2                          = ((BTIMER_Regs *) TIMB2_BASE);
static BTIMER_Regs                              * const TIMB3                          = ((BTIMER_Regs *) TIMB3_BASE);
static DEBUGSS_Regs                             * const DEBUGSS                        = ((DEBUGSS_Regs *) DEBUGSS_BASE);
static FLASHCTL_Regs                            * const FLASHCTL                       = ((FLASHCTL_Regs *) FLASHCTL_BASE);
static CPUSS_Regs                               * const CPUSS                          = ((CPUSS_Regs *) CPUSS_BASE);
static WUC_Regs                                 * const WUC                            = ((WUC_Regs *) WUC_BASE);
static IOMUX_Regs                               * const IOMUX                          = ((IOMUX_Regs *) IOMUX_BASE);
static DMA_Regs                                 * const DMA                            = ((DMA_Regs *) DMA_BASE);
static CRC_Regs                                 * const CRC0                           = ((CRC_Regs *) CRC0_BASE);
static CRC_Regs                                 * const CRC                           = ((CRC_Regs *) CRC0_BASE);
static AESADV_Regs                              * const AESADV                         = ((AESADV_Regs *) AESADV_BASE);
static ADC12_PERIPHERALREGIONSVT_Regs           * const ADC0_SVT                       = ((ADC12_PERIPHERALREGIONSVT_Regs *) ADC0_SVT_BASE);
static GPTIMER_Regs                             * const TIMA0                          = ((GPTIMER_Regs *) TIMA0_BASE);
static UNICOMMUART_Regs                         * const UC4_UART                       = ((UNICOMMUART_Regs *) UC4_UART_BASE);
static UNICOMMI2CC_Regs                         * const UC6_I2CC                       = ((UNICOMMI2CC_Regs *) UC6_I2CC_BASE);
static UNICOMMI2CT_Regs                         * const UC7_I2CT                       = ((UNICOMMI2CT_Regs *) UC7_I2CT_BASE);
static UNICOMMSPI_Regs                          * const UC4_SPI                        = ((UNICOMMSPI_Regs *) UC4_SPI_BASE);
static UNICOMM_Inst_Regs                        * const UC4                            = ((UNICOMM_Inst_Regs *) &UC4_Inst);
static UNICOMM_Inst_Regs                        * const UC6                            = ((UNICOMM_Inst_Regs *) &UC6_Inst);
static UNICOMM_Inst_Regs                        * const UC7                            = ((UNICOMM_Inst_Regs *) &UC7_Inst);
static SPGSS_Regs                               * const SPG0                           = ((SPGSS_Regs *) SPG0_BASE);
static UNICOMMUART_Regs                         * const UC8_UART                       = ((UNICOMMUART_Regs *) UC8_UART_BASE);
static UNICOMMUART_Regs                         * const UC11_UART                      = ((UNICOMMUART_Regs *) UC11_UART_BASE);
static UNICOMMSPI_Regs                          * const UC8_SPI                        = ((UNICOMMSPI_Regs *) UC8_SPI_BASE);
static UNICOMM_Inst_Regs                        * const UC8                            = ((UNICOMM_Inst_Regs *) &UC8_Inst);
static UNICOMM_Inst_Regs                        * const UC11                           = ((UNICOMM_Inst_Regs *) &UC11_Inst);
static FACTORYREGION_OPEN_Regs                  * const FACTORYREGION                  = ((FACTORYREGION_OPEN_Regs *) FACTORYREGION_BASE);


