TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l211x.h
/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define ADC_SYS_NUM_ANALOG_CHAN                       (32)      /* !< Number of analog channels. */
#define CRC0_SYS_CRC32_ENABLE                         (0)       /* !< Parameter to exclude or include 32-bit CRC. */
#define DMA_SYS_N_DMA_CHANNEL                         (3)       /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (2)       /* !< Number of FULL-DMA channels implemented in DMA. If
                                                      SYS_N_DMA_CHANNEL is larger than SYS_N_DMA_FULL_CHANNEL, the
                                                      remaining channel will be BASIC channel with limited functionality. */
#define DMA_SYS_MMR_AUTO                              (1)       /* !< Boolean for if auto enable channels implemented in DMA. */
#define DMA_SYS_MMR_EM                                (1)       /* !< Boolean for if extended mode channels implemented in DMA. */
#define DMA_SYS_MMR_LLONG                             (1)       /* !< Boolean for if channels implemented in DMA with 128-bit access. */
#define DMA_SYS_MMR_STRIDE                            (1)       /* !< Boolean for if channels implemented in DMA with stride mode. */
#define FLASHCTL_SYS_DATAWIDTH                        (64)      /* !< Data bit width of a single flash word:    Minimum: 64    Maximum:
                                                      128 */
#define FLASHCTL_SYS_WEPROTBWIDTH                     (16)      /* !< Bit width of WEPROTB register. */
#define FLASHCTL_SYS_WEPROTAWIDTH                     (0)       /* !< Bit width of WEPROTA register. */
#define FLASHCTL_SYS_WEPROTCWIDTH                     (0)       /* !< Bit width of WEPROTC register. */
#define COMP_SYS_DACOUT_EN                            (1)       /* !< Boolean for if 8-bit DAC output to pin is available */


#define UC4_SPI_SYS_EN_REPEAT                         (0)
#define UC4_SPI_SYS_EN_RTOUT                          (0)
#define UC4_SPI_SYS_EN_COMMAND_DATA                   (0)
#define UC4_SPI_SYS_EN_CS_CTL                         (0)
#define UC4_SPI_SYS_EN_PACKING                        (0)
#define UC4_SPI_SYS_EN_FENTRIES                       (1)
#define UC4_SPI_SYS_EN_DMA                            (0)
#define UC4_SPI_SYS_EN_CLKDIV                         (1)

#define UC8_SPI_SYS_EN_REPEAT                         (0)
#define UC8_SPI_SYS_EN_RTOUT                          (0)
#define UC8_SPI_SYS_EN_COMMAND_DATA                   (0)
#define UC8_SPI_SYS_EN_CS_CTL                         (0)
#define UC8_SPI_SYS_EN_PACKING                        (0)
#define UC8_SPI_SYS_EN_FENTRIES                       (1)
#define UC8_SPI_SYS_EN_DMA                            (0)
#define UC8_SPI_SYS_EN_CLKDIV                         (1)


#define UC4_UART_SYS_GLITCH_FILTER                    (0)
#define UC4_UART_SYS_HW_FLOW_CONTROL                  (1)
#define UC4_UART_SYS_9_BIT                            (1)
#define UC4_UART_SYS_RS485                            (1)
#define UC4_UART_SYS_LIN                              (1)
#define UC4_UART_SYS_DALI                             (1)
#define UC4_UART_SYS_IRDA                             (1)
#define UC4_UART_SYS_SMART_CARD                       (1)
#define UC4_UART_SYS_IDLE_LINE                        (1)
#define UC4_UART_SYS_MANCHESTER_ENCODING              (1)
#define UC4_UART_SYS_FIFO_LENGTH                      (4)
#define UC4_UART_SYS_RX_TIMEOUT                       (1)
#define UC4_UART_SYS_DMA                              (1)
#define UC4_UART_SYS_EXTERNAL_DIRECTION               (1)

#define UC8_UART_SYS_GLITCH_FILTER                    (0)
#define UC8_UART_SYS_HW_FLOW_CONTROL                  (0)
#define UC8_UART_SYS_9_BIT                            (0)
#define UC8_UART_SYS_RS485                            (0)
#define UC8_UART_SYS_LIN                              (0)
#define UC8_UART_SYS_DALI                             (0)
#define UC8_UART_SYS_IRDA                             (0)
#define UC8_UART_SYS_SMART_CARD                       (0)
#define UC8_UART_SYS_IDLE_LINE                        (0)
#define UC8_UART_SYS_MANCHESTER_ENCODING              (0)
#define UC8_UART_SYS_FIFO_LENGTH                      (1)
#define UC8_UART_SYS_RX_TIMEOUT                       (0)
#define UC8_UART_SYS_DMA                              (0)
#define UC8_UART_SYS_EXTERNAL_DIRECTION               (0)

#define UC11_UART_SYS_GLITCH_FILTER                    (0)
#define UC11_UART_SYS_HW_FLOW_CONTROL                  (0)
#define UC11_UART_SYS_9_BIT                            (0)
#define UC11_UART_SYS_RS485                            (0)
#define UC11_UART_SYS_LIN                              (0)
#define UC11_UART_SYS_DALI                             (0)
#define UC11_UART_SYS_IRDA                             (0)
#define UC11_UART_SYS_SMART_CARD                       (0)
#define UC11_UART_SYS_IDLE_LINE                        (0)
#define UC11_UART_SYS_MANCHESTER_ENCODING              (0)
#define UC11_UART_SYS_FIFO_LENGTH                      (1)
#define UC11_UART_SYS_RX_TIMEOUT                       (0)
#define UC11_UART_SYS_DMA                              (0)
#define UC11_UART_SYS_EXTERNAL_DIRECTION               (0)

/******************************************************************************
* DMA Triggers                                                                *
******************************************************************************/

/* External DMA Triggers */
#define DMA_SOFTWARE_TRIG                             (0)
#define DMA_GENERIC_SUB0_TRIG                         (1)
#define DMA_GENERIC_SUB1_TRIG                         (2)
#define DMA_AESADV_AES_0_TRIG                         (3)
#define DMA_AESADV_AES_1_TRIG                         (4)
#define DMA_UC4_RX_BD_TRIG                            (5)
#define DMA_UC4_TX_BD_TRIG                            (6)
#define DMA_UC6_RX_BD_TRIG                            (7)
#define DMA_UC6_TX_BD_TRIG                            (8)
#define DMA_UC7_RX_BD_TRIG                            (9)
#define DMA_UC7_TX_BD_TRIG                            (10)
#define DMA_UC8_RX_BD_TRIG                            (11)
#define DMA_UC8_TX_BD_TRIG                            (12)
#define DMA_ADC0_EVT_GEN_BD_TRIG                      (13)

/* Internal DMA Triggers */
#define DMA_CH_0_TRIG                                 (0)
#define DMA_CH_1_TRIG                                 (1)
#define DMA_CH_2_TRIG                                 (2)



