TexasInstruments/mspm0-sdk/source/ti/devices/msp/m0p/mspm0l211x.h
/*IOMUX_PINCM36[PF] Bits */
#define IOMUX_PINCM36_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM36_PF_GPIOA_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM36_PF_UC4_CS0                      ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_UC4_CTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_UC4_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_UC4_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM36_PF_UC11_RX                      ((uint32_t)0X0000000A)

/*IOMUX_PINCM37[PF] Bits */
#define IOMUX_PINCM37_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM37_PF_GPIOA_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM37_PF_UC4_POCI                     ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_UC4_RTS                      ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_UC7_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM37_PF_TIMG14_CCP2                  ((uint32_t)0X00000007)
#define IOMUX_PINCM37_PF_LCD_LCDEN                    ((uint32_t)0X00000009)

/*IOMUX_PINCM38[PF] Bits */
#define IOMUX_PINCM38_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM38_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM38_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_UC8_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_UC7_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM38_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000007)
#define IOMUX_PINCM38_PF_LCD_LCDSON                   ((uint32_t)0X00000009)

/*IOMUX_PINCM39[PF] Bits */
#define IOMUX_PINCM39_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM39_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM39_PF_UC8_PICO                     ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_UC8_TX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_UC8_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_UC8_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_UC7_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM39_PF_TIMG2_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM39_PF_TIMG14_CCP2                  ((uint32_t)0X00000007)
#define IOMUX_PINCM39_PF_LCD_LCDLFCLK                 ((uint32_t)0X0000000A)

/*IOMUX_PINCM40[PF] Bits */
#define IOMUX_PINCM40_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM40_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM40_PF_UC8_SCLK                     ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_UC8_RX                       ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_UC8_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_UC8_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_UC7_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM40_PF_TIMG14_CCP3                  ((uint32_t)0X00000007)
#define IOMUX_PINCM40_PF_UC4_CS0                      ((uint32_t)0X00000009)
#define IOMUX_PINCM40_PF_UC4_CTS                      ((uint32_t)0X00000009)
#define IOMUX_PINCM40_PF_LCD_LCDEN                    ((uint32_t)0X0000000A)

/*IOMUX_PINCM41[PF] Bits */
#define IOMUX_PINCM41_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM41_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM41_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_UC8_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_UC7_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM41_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM41_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)

/*IOMUX_PINCM42[PF] Bits */
#define IOMUX_PINCM42_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM42_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM42_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM42_PF_UC8_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UC8_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM42_PF_UC7_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM42_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM42_PF_TIMG14_CCP1                  ((uint32_t)0X00000006)

/*IOMUX_PINCM43[PF] Bits */
#define IOMUX_PINCM43_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM43_PF_GPIOB_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM43_PF_UC11_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM43_PF_UC4_PICO                     ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC4_TX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM43_PF_UC6_SCL                      ((uint32_t)0X00000004)
#define IOMUX_PINCM43_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM43_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM43_PF_TIMG1_CCP0                   ((uint32_t)0X00000009)
#define IOMUX_PINCM43_PF_LCD_LCDSON                   ((uint32_t)0X0000000A)

/*IOMUX_PINCM44[PF] Bits */
#define IOMUX_PINCM44_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM44_PF_GPIOB_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM44_PF_UC11_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM44_PF_UC4_SCLK                     ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC4_RX                       ((uint32_t)0X00000003)
#define IOMUX_PINCM44_PF_UC6_SDA                      ((uint32_t)0X00000004)
#define IOMUX_PINCM44_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM44_PF_TIMG14_CCP1                  ((uint32_t)0X00000006)
#define IOMUX_PINCM44_PF_TIMG1_CCP1                   ((uint32_t)0X00000009)
#define IOMUX_PINCM44_PF_LCD_LCDLFCLK                 ((uint32_t)0X0000000A)

/*IOMUX_PINCM45[PF] Bits */
#define IOMUX_PINCM45_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM45_PF_GPIOB_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM45_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM45_PF_UC4_POCI                     ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_UC4_RTS                      ((uint32_t)0X00000003)
#define IOMUX_PINCM45_PF_UC4_CS0                      ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_UC4_CTS                      ((uint32_t)0X00000005)
#define IOMUX_PINCM45_PF_TIMG2_CCP1                   ((uint32_t)0X00000006)
#define IOMUX_PINCM45_PF_TIMG14_CCP2                  ((uint32_t)0X00000007)

